{
  "start": {
    "message": "إذا كان هناك أي شيء غير واضح أو غير دقيق أو يحتوي على أكثر من طريقة ممكنة للتنفيذ، يجب عليك سؤالي قبل المتابعة، حتى يمكن إكمال المهمة بشكل كامل ودقيق وبدون أخطاء."
  },

  "end": {
    "message": "يجب عليك تنفيذ الاتي بدون فقدان أي ميزات أو حالات أو سلوكيات موجودة حاليًا بالمشروع، وبدون التسبب في أي كسر أو أخطاء في الكود."
  },

  "rename": {
    "instructions": "في صفحة x2x قم بتغيير كل من محددات CSS (Classes)، معرفات HTML (IDs)، أسماء الدوال الداخلية المعرفة في الصفحة، متغيرات JavaScript المعرفة محلياً، لتصبح جميعها تبدأ ببادئة x1x_ مع الاحتفاظ بالتعليقات باللغة العربية وإضافة جمل مسك الأخطاء."
  },

  "deleteCss": {
    "instructions": "المطلوب تنفيذه بدقة: افتح الملف pages/productView.html، واحذف جميع أسطر الروابط الخاصة بملفات CSS التالية: ../style/showProduct.css. قبل الحذف، يجب تنفيذ ما يلي: تحليل جميع عناصر HTML داخل الصفحة، تحليل جميع أجزاء JavaScript، تحديد كل الفئات والسمات المستخدمة، البحث داخل ملف CSS المذكور عن القواعد المرتبطة بها فقط، نسخ القواعد المطابقة، لصقها داخل <style> في أعلى الصفحة، التأكد أن الصفحة تعمل كما كانت بدون فقد أو كسر، دمج الأنماط بدون تكرار، وبعد التأكد قم بحذف روابط ملفات CSS نهائياً."
  },

  "changColor": {
    "instructions": "جميع الألوان داخل x4x يجب أن تكون مستخرجة من style/variables.css فقط."
  },

  "neglect": {
    "ignore": [
      "node_modules",
      ".git",
      ".vscode",
      ".DS_Store",
      "Thumbs.db",
      ".gitignore",
      "delete-account.html",
      "favicon.ico",
      "privacy.html",
      "test.html",
      "get",
      "extensions.txt",
      "accounts.txt",
      "github.txt",
      "how_id_6.md",
      "notification discuse.txt",
      "formatted_drizzle_files (1).md",
      "formatted_drizzle_files.md",
      "list.json",
      "docs",
      "setting.json",
      "اوامر الملفات.txt",
      "الخطة.txt"
    ]
  },

  "read": {
    "instructions": "أريدك أن تقوم بقراءة جميع الملفات التي أرسلتها لك قراءة شاملة ودقيقة، بما في ذلك ملفات HTML وCSS وJavaScript وأي ملفات أخرى تابعة للمشروع. بعد القراءة، قم بإجراء تحليل معمّق للكود داخل كل ملف، واستخرج: العلاقات بين الملفات وتفاعلها، تدفق البيانات، تحليل كل الدوال ووظائفها واعتمادها، فهم كامل للـ Architecture، كيفية تحميل الملفات وتنفيذ الأكواد، إنشاء نموذج داخلي دقيق للمشروع، تحديد ملفات غير مستخدمة أو شيفرات ميتة، اكتشاف نقاط الضعف أو التكرار، فهم بنية الواجهات الأمامية وطريقة التخزين والتفاعل. بعد إتمام التحليل، يجب أن تكون قادرًا على إدارة المشروع بالكامل كما لو أنك من قام ببنائه، دون عرض النتائج الآن. عند الانتهاء فقط اكتب: تم التحليل."
  }
}
